Revit 2016 API
ElementTransformUtils Methods
The ElementTransformUtils type exposes the following members.
Methods
Name | Description
CanMirrorElement
 Determines whether element can be mirrored.
CanMirrorElements
 Determines whether elements can be mirrored.
CopyElement
 Copies an element and places the copy at a location indicated by a given transformation.
CopyElements(Document, ICollection<ElementId>, XYZ)
 Copies a set of elements and places the copies at a location indicated by a given translation.
CopyElements(Document, ICollection<ElementId>, Document, Transform, CopyPasteOptions)
 Copies a set of elements from source document to destination document.
CopyElements(View, ICollection<ElementId>, View, Transform, CopyPasteOptions)
 Copies a set of elements from source view to destination view.
GetTransformFromViewToView
 Returns a transformation that is applied to elements when copying from one view to another view.
MirrorElement
 Creates a mirrored copy of an element about a given plane.
MirrorElements(Document, ICollection<ElementId>, Plane) |  Obsolete.
 Creates a mirrored copy of a set of elements about a given plane.
MirrorElements(Document, ICollection<ElementId>, Plane, Boolean)
 Mirrors a set of elements about a given plane.
MoveElement
 Moves one element by a given transformation.
MoveElements
 Moves a set of elements by a given transformation.
RotateElement
 Rotates an element about the given axis and angle.
RotateElements
 Rotates a set of elements about the given axis and angle.
See Also
ElementTransformUtils Class
Autodesk.Revit.DB Namespace